<pre>
PHP  
Мова програмування, початково призначена для покращення можливостей
HTML (зміни, інсьрукції, вирази, файли/шаборни)
На сьогодні - повноцінна мова програмування, яка частіше використовується для задач бекенду.

За приблизною аналогією з JS, PHP має подвійне розуміння 
-частина (модуль) веб-сервера, яка продовжує оброблення запитів
-самостійний продукт для програм.

Для встановлення краще за все використати збіпку (налаштовані між собою веб-сервер, PHP, СУБД та інше).
Такими є XAMPP, OpenServer, Danver ...

веб-запит--[Apache(веб-сервер)] сайт1 (index.php) або сайтN (index.php)
веб-сервер приймає запит, розбирає його (виділяє метод, заголовки, передані форми, файли тощо) 
та запускає PHP файл у запитуваному сайті.

Виведення PHP (як модуля) потряпляє не на "екран", а в тіло HTML

-тип мови: інтерпретатор (Repl)
-4GL
-парадигма: процедурна(з підтримкою ООП)
=
==========================================================================================================================

Для зручності роботи з кількома проєктами (сайтамми) бажано налаштувати локальний хостінг
-папка з конфігурацією Apache
-за зразком наведеним у конфігурації, створюємо запис для нашого проєкту
-додаємо імена локальних сайтів до локальної служби DNS
=преходимо до C:\Windows\System32\drivers\etc
=відкриваємо на редагування (адмі) файл hosts

    127.0.0.1        php-dz.loc
    ::1              php-dz.loc
    127.0.0.1        www.php-dz.loc
    ::1              www.php-dz.loc

-зупиняємо та запускаємо Apache з XAMPP
</pre>