<h1 class="center">Регулярні вирази</h1>
<p>
    <b>Мова регулярних виразів (Regular Expressions або regex)</b> - це потужний інструмент 
    для роботи з рядками в текстових данних. Основні елементи регулярних виразів 
    включають спецсимволи, групи, квантифікатори і якорі. 
</p>

<h2 class="center">Спецсимволи</h2>
<ul>
    <li><b>`.` (крапка):</b><br/> Позначає будь-який символ, крім нового рядка</li>
    <li><b>`\` (зворотний слеш):</b><br/> Використовується для екранування спецсимволів, таких як `.`, `\`, `+`, тощо</li>
</ul>
   
<h2 class="center">Групи</h2>
<ul>
    <li><b>`[]` (квадратні дужки):</b><br/> Визначає набір символів, які можуть збігатися. Наприклад, 
        `[aeiou]` буде відповідати будь-якому голосному символу.</li>
    <li><b>`()` (круглі дужки):</b><br/> Групує частини регулярного виразу, дозволяючи застосовувати 
        квантифікатори до цих частин.</li>
</ul>

<h2 class="center">Квантифікатори</h2>
<ul>
    <li><b>`*` (зірочка):</b><br/> Відповідає 0 або більше входжень попереднього символу або групи.</li>
    <li><b>`+` (плюс):</b><br/> Відповідає 1 або більше входжень попереднього символу або групи.</li>
    <li><b>`?` (знак питання):</b><br/> Відповідає 0 або 1 входженню попереднього символу або групи.</li>
    <li><b>`{n}`:</b><br/> Відповідає рівно n входженням попереднього символу або групи.</li>
    <li><b>`{n,}`:</b><br/> Відповідає n або більше входженням попереднього символу або групи.</li>
    <li><b>`{n,m}`:</b><br/> Відповідає від n до m входжень попереднього символу або групи.</li>
</ul>

<h2 class="center">Якорі</h2>
<ul>
    <li><b>`^` (каретка):</b><br/> Вказує на початок рядка.</li>
    <li><b>`$`:</b><br/> Вказує на кінець рядка.</li>
    <li><b>`\b`:</b><br/> Вказує на границю слова (слово має починатися або закінчуватися).</li>
</ul>

<h3 class="center">Приклад регулярного виразу для знаходження електронної пошти:</h3>

<P class="center">
    <b><code>^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$</code></b>
</P>

<p >У цьому виразі:</p>
<ul>
    <li><b>`^`</b><br/> вказує на початок рядка.</li>
    <li><b>`[a-zA-Z0-9._%+-]+`</b><br/> відповідає локальній частині електронної пошти.</li>
    <li><b>`@`</b><br/> відповідає символу "@", який є обов'язковим.</li>
    <li><b>`[a-zA-Z0-9.-]+`</b><br/> відповідає доменній частині електронної пошти.</li>
    <li><b>`\.`</b><br/> відповідає крапці, яка є обов'язковою перед розширенням домену.</li>
    <li><b>`[a-zA-Z]{2,}`</b><br/> відповідає розширенню домену (наприклад, com, org, net) 
        довжиною щонайменше 2 символи.</li>
    <li><b>`$`</b><br/> вказує на кінець рядка.</li>
</ul>